# Shell & terminal
brew "gh"
brew "stow"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"

# Version & runtime management
brew "mise"

# Editor & TUI
brew "neovim"
brew "yazi"
brew "lazygit"

# Language servers, linters, formatters - note no nixd
brew "bash-language-server"
brew "shellcheck"
brew "lua-language-server"
brew "stylua"
brew "biome"
brew "prettierd"
brew "alejandra"

# GUI
cask "ghostty"
cask "nikitabobko/tap/aerospace"
brew "felixkratz/formulae/borders"

# AI
brew "pi-coding-agent"
